<a href="https://colab.research.google.com/github/tim530712345/20210612_pandas/blob/main/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [111]:
import pandas as pd
ex_pandas = pd.Series([1,3,5,7,9],index=['a','b','c','d','e']) # 一維資料

In [112]:
ex_pandas.values

array([1, 3, 5, 7, 9])

In [113]:
ex_pandas.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [114]:
ex_pandas['c']

5

In [115]:
'b' in ex_pandas

True

In [116]:
data = {'name':['Tim','Kyle'],'year':[1994,1990],'month':[2,8]}
myframe = pd.DataFrame(data) #  二維資料
myframe

   name  year  month
0   Tim  1994      2
1  Kyle  1990      8

In [117]:
myframe = pd.DataFrame(data,columns=['name','month','year']) # columns 更改欄位順序
myframe

   name  month  year
0   Tim      2  1994
1  Kyle      8  1990

In [118]:
df = pd.read_csv('E1-2-2-1-input.csv') # 檔案讀取
df.head(5) # 預設前5筆資料

    sno     sna  ...  bemp  act
0  1001    大鵬華城  ...    22    1
1  1002   汐止火車站  ...    36    1
2  1003   汐止區公所  ...    33    1
3  1004  國泰綜合醫院  ...    22    1
4  1005    裕隆公園  ...    17    1

[5 rows x 14 columns]

In [119]:
df.tail() # 後五筆資料 預設

      sno      sna  ...  bemp  act
490  1502  縣民漢生東路口  ...    48    1
491  1503     時光公園  ...    27    1
492  1504     積穗國中  ...    15    1
493  1505     員和公園  ...    30    1
494  1506     環河公園  ...    12    1

[5 rows x 14 columns]

In [120]:
df.info() # 檔案資訊
df.shape # 顯示欄列數量

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 495 entries, 0 to 494
Data columns (total 14 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   sno      495 non-null    int64
 1   sna      495 non-null    object
 2   tot      495 non-null    int64
 3   sbi      495 non-null    int64
 4   sarea    495 non-null    object
 5   mday     495 non-null    int64
 6   lat      495 non-null    float64
 7   lng      495 non-null    float64
 8   ar       495 non-null    object
 9   sareaen  495 non-null    object
 10  snaen    495 non-null    object
 11  aren     495 non-null    object
 12  bemp     495 non-null    int64
 13  act      495 non-null    int64
dtypes: float64(2), int64(6), object(6)
memory usage: 54.3+ KB

(495, 14)

In [121]:
df['sna'] # 查詢欄位sna的資料(一維)
df['sna'][0:3] # 查詢sna前三筆資料

0     大鵬華城
1    汐止火車站
2    汐止區公所
Name: sna, dtype: object

In [122]:
df[['sna','sno','tot','ar']] # 顯示兩個欄位以上的資料(二維) 多加[]
df[['sna','sno']][:20] # 前20筆資料

              sna   sno
0            大鵬華城  1001
1           汐止火車站  1002
2           汐止區公所  1003
3          國泰綜合醫院  1004
4            裕隆公園  1005
5    捷運大坪林站(3號出口)  1006
6        汐科火車站(北)  1007
7            興華公園  1008
8        三重國民運動中心  1009
9     捷運三重站(3號出口)  1010
10           樟樹國小  1011
11           金龍國小  1012
12           白雲國小  1013
13       東勢宜興活動中心  1014
14           後港公園  1015
15         福營行政中心  1016
16           西盛公園  1017
17  忠誠里(北新路2段97巷)  1018
18           仁愛廣場  1019
19           重陽國小  1020

In [123]:
# insert(): 資料新增 加入欄位與值 不會影響原本的檔案資料(沒有回存之前都是不會改變得)
df.insert(9,column='sports',value='basketball') 
df.head(5)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 495 entries, 0 to 494
Data columns (total 15 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   sno      495 non-null    int64
 1   sna      495 non-null    object
 2   tot      495 non-null    int64
 3   sbi      495 non-null    int64
 4   sarea    495 non-null    object
 5   mday     495 non-null    int64
 6   lat      495 non-null    float64
 7   lng      495 non-null    float64
 8   ar       495 non-null    object
 9   sports   495 non-null    object
 10  sareaen  495 non-null    object
 11  snaen    495 non-null    object
 12  aren     495 non-null    object
 13  bemp     495 non-null    int64
 14  act      495 non-null    int64
dtypes: float64(2), int64(6), object(7)
memory usage: 58.1+ KB

In [124]:
nba = pd.read_csv('NBA.csv')
# 刪除NaN(空值)的資料 無法判斷資料的正確與否
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 457 entries, 0 to 456
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    int64
 3   Position  457 non-null    object
 4   Age       457 non-null    int64
 5   Height    457 non-null    object
 6   Weight    457 non-null    int64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(1), int64(3), object(5)
memory usage: 32.3+ KB

In [125]:
# dropna(): 刪除NaN(空值)的資料 無法判斷資料的正確與否
nbanew = nba.dropna() 
nbanew.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 364 entries, 0 to 456
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      364 non-null    object
 1   Team      364 non-null    object
 2   Number    364 non-null    int64
 3   Position  364 non-null    object
 4   Age       364 non-null    int64
 5   Height    364 non-null    object
 6   Weight    364 non-null    int64
 7   College   364 non-null    object
 8   Salary    364 non-null    float64
dtypes: float64(1), int64(3), object(5)
memory usage: 28.4+ KB

In [133]:
# fillna(): 資料填充 把空值代換掉
nba.fillna(0)

              Name            Team  ...            College     Salary
0    Avery Bradley  Boston Celtics  ...              Texas  7730337.0
1      Jae Crowder  Boston Celtics  ...          Marquette  6796117.0
2     John Holland  Boston Celtics  ...  Boston University        0.0
3      R.J. Hunter  Boston Celtics  ...      Georgia State  1148640.0
4    Jonas Jerebko  Boston Celtics  ...                  0  5000000.0
..             ...             ...  ...                ...        ...
452     Trey Lyles       Utah Jazz  ...           Kentucky  2239800.0
453   Shelvin Mack       Utah Jazz  ...             Butler  2433333.0
454      Raul Neto       Utah Jazz  ...                  0   900000.0
455   Tibor Pleiss       Utah Jazz  ...                  0  2900000.0
456    Jeff Withey       Utah Jazz  ...             Kansas   947276.0

[457 rows x 9 columns]

In [135]:
# 資料做排序
nbanew.sort_values('Salary')

                Name                   Team  ...               College      Salary
291  Orlando Johnson   New Orleans Pelicans  ...      UC Santa Barbara     55722.0
130     Phil Pressey           Phoenix Suns  ...              Missouri     55722.0
135    Alan Williams           Phoenix Suns  ...      UC Santa Barbara     83397.0
175     Jordan McRae    Cleveland Cavaliers  ...             Tennessee    111196.0
184    Lorenzo Brown        Detroit Pistons  ...  North Carolina State    111444.0
..               ...                    ...  ...                   ...         ...
164     Derrick Rose          Chicago Bulls  ...               Memphis  20093064.0
414     Kevin Durant  Oklahoma City Thunder  ...                 Texas  20158622.0
100       Chris Paul   Los Angeles Clippers  ...           Wake Forest  21468695.0
339       Chris Bosh             Miami Heat  ...          Georgia Tech  22192730.0
33   Carmelo Anthony        New York Knicks  ...              Syracuse  22875000.0

[364 rows x 9 columns]

In [142]:
# 資料篩選 先選擇欄位 在選擇其中要的資料
# nba['Team']=='Oklahoma City Thunder'--> 只會顯示True False
filter = (nba['Team']=='Oklahoma City Thunder')
nba[filter]

                  Name                   Team  ...       College      Salary
412       Steven Adams  Oklahoma City Thunder  ...    Pittsburgh   2279040.0
413      Nick Collison  Oklahoma City Thunder  ...        Kansas   3750000.0
414       Kevin Durant  Oklahoma City Thunder  ...         Texas  20158622.0
415         Randy Foye  Oklahoma City Thunder  ...     Villanova   3135000.0
416       Josh Huestis  Oklahoma City Thunder  ...      Stanford   1140240.0
417        Serge Ibaka  Oklahoma City Thunder  ...           NaN  12250000.0
418        Enes Kanter  Oklahoma City Thunder  ...      Kentucky  16407500.0
419       Mitch McGary  Oklahoma City Thunder  ...      Michigan   1463040.0
420      Nazr Mohammed  Oklahoma City Thunder  ...      Kentucky    222888.0
421     Anthony Morrow  Oklahoma City Thunder  ...  Georgia Tech   3344000.0
422      Cameron Payne  Oklahoma City Thunder  ...  Murray State   2021520.0
423     Andre Roberson  Oklahoma City Thunder  ...      Colorado   1210800.0
424       Kyle Singler  Oklahoma City Thunder  ...          Duke   4500000.0
425       Dion Waiters  Oklahoma City Thunder  ...      Syracuse   5138430.0
426  Russell Westbrook  Oklahoma City Thunder  ...          UCLA  16744218.0

[15 rows x 9 columns]

In [145]:
# 篩選紐約尼克隊 薪水超過一千萬
team = nba['Team']=='New York Knicks'
salary = nba['Salary']>=10000000
nba[team & salary]

                  Name                   Team  ...       College      Salary
5         Amir Johnson         Boston Celtics  ...           NaN  12000000.0
23         Brook Lopez          Brooklyn Nets  ...      Stanford  19689000.0
29      Thaddeus Young          Brooklyn Nets  ...  Georgia Tech  11235955.0
30       Arron Afflalo        New York Knicks  ...          UCLA   8000000.0
31        Lou Amundson        New York Knicks  ...          UNLV   1635476.0
..                 ...                    ...  ...           ...         ...
417        Serge Ibaka  Oklahoma City Thunder  ...           NaN  12250000.0
418        Enes Kanter  Oklahoma City Thunder  ...      Kentucky  16407500.0
426  Russell Westbrook  Oklahoma City Thunder  ...          UCLA  16744218.0
446     Derrick Favors              Utah Jazz  ...  Georgia Tech  12000000.0
448     Gordon Hayward              Utah Jazz  ...        Butler  15409570.0

[86 rows x 9 columns]

In [150]:
# between 取中間值
age = nba['Age'].between(30,40)
nba[age]

                Name                    Team  ...           College      Salary
19      Jarrett Jack           Brooklyn Nets  ...      Georgia Tech   6300000.0
30     Arron Afflalo         New York Knicks  ...              UCLA   8000000.0
31      Lou Amundson         New York Knicks  ...              UNLV   1635476.0
33   Carmelo Anthony         New York Knicks  ...          Syracuse  22875000.0
34     Jose Calderon         New York Knicks  ...               NaN   7402812.0
..               ...                     ...  ...               ...         ...
415       Randy Foye   Oklahoma City Thunder  ...         Villanova   3135000.0
420    Nazr Mohammed   Oklahoma City Thunder  ...          Kentucky    222888.0
421   Anthony Morrow   Oklahoma City Thunder  ...      Georgia Tech   3344000.0
434      Chris Kaman  Portland Trail Blazers  ...  Central Michigan   5016000.0
440    Brian Roberts  Portland Trail Blazers  ...            Dayton   2854940.0

[122 rows x 9 columns]